app/views/criteria/update.js.erb

  $("#criterion-row-<%= @criterium.id %> .name span").text("<%= @criterium.name %>")
  $("#criterion-row-<%= @criterium.id %> .output ul").html("<% @criterium.frameworks.each do |f| %><li><%= f.name %></li><% end %>")
---
SELECT "frameworks".* FROM "frameworks" INNER JOIN "framework_criteria" ON "frameworks"."id" = "framework_criteria"."framework_id" WHERE "framework_criteria"."criterium_id" = $1  [["criterium_id", 35]]