app/controllers/decision_reason_controller.rb

  def get_status_reasons
    bootcamper = Bootcamper.find(params[:id])
    bootcamper_stage_reasons = bootcamper.get_decision_reasons(params[:stage])
    status_reasons = DecisionStatus.get_reasons(params[:status])

    stage_and_bootcamper_reasons = {}

    status_reasons.each do |reason|
---
SELECT  "bootcampers".* FROM "bootcampers" WHERE "bootcampers"."camper_id" = $1 LIMIT $2  [["camper_id", "YTHBERLO 38"], ["LIMIT", 1]]
SELECT  "decision_statuses".* FROM "decision_statuses" WHERE "decision_statuses"."status" = $1 LIMIT $2  [["status", "In Progress"], ["LIMIT", 1]]