app/controllers/scores_controller.rb

SELECT SUM("scores"."score") FROM "scores" WHERE (camper_id = 'YTHBERLO 61')
INSERT INTO "scores" ("score", "week", "comments", "camper_id", "assessment_id", "created_at", "updated_at", "phase_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    return unless helpers.admin? || helpers.user_is_lfa?(params[:id])

    unless params[:scores].blank?
      params[:scores].each do |score|
        Score.save_score(score_params(score), params[:id])

SELECT  "bootcampers".* FROM "bootcampers" WHERE "bootcampers"."camper_id" = $1 LIMIT $2  [["camper_id", "1"], ["LIMIT", 1]]
SELECT  "phases".* FROM "phases" ORDER BY "phases"."id" ASC LIMIT $1  [["LIMIT", 1]]
SELECT  "assessments".* FROM "assessments" ORDER BY "assessments"."id" ASC LIMIT $1  [["LIMIT", 1]]
---
  def new
    @bootcamper = Bootcamper.find_by(camper_id: params[:id])
    @form_phase = Phase.first
    @form_assessment = Assessment.first

SELECT "phases".* FROM "phases"
---
  def set_total_assessements
    @total_assessments = 0
    Phase.all.each do |phase|

SELECT COUNT(*) FROM "scores" WHERE "scores"."camper_id" = $1  [["camper_id", "YTHBERLO 61"]]
UPDATE "bootcampers" SET "progress_week1" = $1, "progress_week2" = $2, "overall_average" = $3, "week1_average" = $4, "week2_average" = $5, "project_average" = $6, "value_average" = $7, "output_average" = $8, "feedback_average" = $9, "updated_at" = $10 WHERE "bootcampers"."camper_id" = $11
---
  def set_camper_progress
    set_total_assessements
    @camper_scores = Score.where(camper_id: params[:id])
    @score = @camper_scores.count
    Bootcamper.update_campers_progress(params[:id], @score, @total_assessments)